; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	thermograph0 - mode
	spectrograph1 - mode
	Star3 - direction
	GroundStation6 - direction
	GroundStation8 - direction
	Star0 - direction
	Star1 - direction
	Star7 - direction
	Star2 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation8)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 Star1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 spectrograph1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star9)
	(supports instrument5 spectrograph1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star0)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 Star7)
	(calibration_target instrument6 Star1)
	(supports instrument7 spectrograph1)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 spectrograph1)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation5)
	(calibration_target instrument8 GroundStation4)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation6)
)
(:goal (and
	(pointing satellite3 Planet10)
	(pointing satellite4 Star3)
	(have_image Star9 thermograph0)
	(have_image Planet10 thermograph0)
	(have_image Phenomenon11 spectrograph1)
	(have_image Planet12 spectrograph1)
	(have_image Phenomenon13 spectrograph1)
	(have_image Star14 spectrograph1)
))

)

; plan
1. (turn_to satellite4 star3 groundstation6)
   deleted: (pointing satellite4 groundstation6)
   added: (pointing satellite4 star3)
   goals met: 1 of 8
2. (turn_to satellite3 star0 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 star0)
   goals met: 1 of 8
3. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 1 of 8
4. (calibrate satellite3 instrument5 star0)
   added: (calibrated instrument5)
   goals met: 1 of 8
5. (turn_to satellite3 planet12 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 planet12)
   goals met: 1 of 8
6. (take_image satellite3 planet12 instrument5 spectrograph1)
   added: (have_image planet12 spectrograph1)
   goals met: 2 of 8
7. (turn_to satellite3 phenomenon13 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 phenomenon13)
   goals met: 2 of 8
8. (take_image satellite3 phenomenon13 instrument5 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 3 of 8
9. (turn_to satellite3 phenomenon11 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 phenomenon11)
   goals met: 3 of 8
10. (take_image satellite3 phenomenon11 instrument5 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 4 of 8
11. (turn_to satellite3 star14 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 star14)
   goals met: 4 of 8
12. (take_image satellite3 star14 instrument5 spectrograph1)
   added: (have_image star14 spectrograph1)
   goals met: 5 of 8
13. (turn_to satellite3 star9 star14)
   deleted: (pointing satellite3 star14)
   added: (pointing satellite3 star9)
   goals met: 5 of 8
14. (take_image satellite3 star9 instrument5 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 6 of 8
15. (turn_to satellite3 planet10 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 planet10)
   goals met: 7 of 8
16. (take_image satellite3 planet10 instrument5 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 8 of 8
